CSI API ETABS v1

# cSapModelPatternDef Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPattern PatternDef { get; }

    ReadOnly Property PatternDef As cPattern
    	Get

    Dim instance As cSapModel
    Dim value As cPattern

    value = instance.PatternDef

    property cPattern^ PatternDef {
    	cPattern^ get ();
    }

    abstract PatternDef : cPattern with get

#### Property Value

Type: cPattern

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com